<div style="text-align: right"> 
Universidad Nacional de Colombia <br>
Maestría en Ciencias - Estadística <br>
Big Data - Métodos Intensivos de Computación Estadística -2023829 <br>
Semestre 2021-1 
</div>

<div style="text-align: right"> 
Estudiante: Diego Clemente Rojas Chingate   <br>
</div>

<img src="img/spark_logo.png" align="right" width="30%">

# Tarea: Reproducir el cuaderno [spark.ipynb](https://github.com/AprendizajeProfundo/BigData/blob/main/Spark/Cuadernos/Spark_install.ipynb) localmente

## Instalar prerrequisitos

[drojas@localhost ~]$ sudo yum install java-11-openjdk java-11-openjdk-devel git
[drojas@localhost ~]$ cd ~java-11-openjdk
[drojas@localhost ~]$ wget http://downloads.lightbend.com/scala/2.11.8/scala-2.11.8.rpm
[drojas@localhost ~]$ sudo yum install scala-2.11.8.rpm

[drojas@localhost ~]$ java -version; javac -version; scala -version; git --version

openjdk version "1.8.0_275"  
OpenJDK Runtime Environment (build 1.8.0_275-b01)  
OpenJDK 64-Bit Server VM (build 25.275-b01, mixed mode)  
javac 1.8.0_275  
Scala code runner version 2.11.8 -- Copyright 2002-2016, LAMP/EPFL  
git version 2.31.0

## Instalar Spark

[drojas@localhost ~]$ wget https://downloads.apache.org/spark/spark-3.1.2/spark-3.1.2-bin-hadoop3.2.tgz
[drojas@localhost ~]$ tar xvf spark-*
[drojas@localhost ~]$ sudo mv spark-3.1.2-bin-hadoop3.2 /opt/spark

## Configurar el entorno de Spark

[drojas@localhost ~]$ echo "export SPARK_HOME=/opt/spark" >> ~/.bash_profile
[drojas@localhost ~]$ echo "export PATH=$PATH:$SPARK_HOME/bin:$SPARK_HOME/sbin" >> ~/.bash_profile
[drojas@localhost ~]$ echo "export PYSPARK_PYTHON=/usr/bin/python3" >> ~/.bash_profile
[drojas@localhost ~]$ source ~/.bash_profile

## Iniciar el servidor maestro autónomo de Spark

[drojas@localhost ~]$ start-master.sh

<img src="img/master.png" align="center" width="100%">

## Iniciar Spark Slave Server (Iniciar un proceso de trabajo)

[drojas@localhost ~]$ start-slave.sh spark://localhost:7077

<img src="img/slave.png" align="center" width="100%">

## Shell de Spark (Interfaz de Scala)

<img src="img/shell.png" align="center" width="100%">

## Python en Spark: PySpark

<img src="img/pyspark.png" align="center" width="100%">

## Comandos básicos para iniciar y detener el servidor maestro y los trabajadores

A continuación, se muestran los comandos básicos para iniciar y detener el `servidor maestro Apache Spark` y los trabajadores. Dado que esta configuración es solo para una máquina, las secuencias de comandos que ejecuta se establecen de forma predeterminada en el host local.

Para iniciar una instancia de servidor maestro en la máquina actual, ejecute el comando que usamos anteriormente en este tutoria. 

- `start-master.sh`

Para pararlo use 

- `stop-master.sh`

Para lanzar y detener instancias de workers aosicadoa a su masters sue respectivamente

- `start-slave.sh`
- `stop-slave.sh`

Finalmente¿, para lanzar y detener instancias  tanto de master como slave escriba

-  `start-all.sh`
- `stop-all.sh`

# Instalación  para correr Spark desde Jupyterlab

[drojas@localhost ~]$ conda create -n spark python=3.9
[drojas@localhost ~]$ conda activate spark
(spark) [drojas@localhost ~]$ conda install -c conda-forge findspark
(spark) [drojas@localhost ~]$ conda install -c conda-forge pyspark

In [1]:
import findspark
findspark.init()
import pyspark
import random
from pyspark import SparkConf, SparkContext

In [2]:
# crea un contexto Spark
sc = pyspark.SparkContext(appName="Pi")

# genera 100 millones muestras para estimar $\pi$.
num_samples = 100000000
def inside(p):     
  x, y = random.random(), random.random()
  return x*x + y*y < 1
count = sc.parallelize(range(0, num_samples)).filter(inside).count()
pi = 4 * count / num_samples
print(pi)

# detiene el contexto
sc.stop()

3.1416852

## Spark dataframes

In [3]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName('myFirstSparkSession').getOrCreate()

df = spark.read.csv("./datos/employee_data.csv",header=True)

In [4]:
df.show()

+-----------+-------------+---+----------+-----+
|employee_id|employee_name|age|  location|hours|
+-----------+-------------+---+----------+-----+
|       G001|       Pichai| 47|California|   14|
|       M002|         Bill| 64|Washington|   10|
|       A003|         Jeff| 56|Washington|   11|
|       A004|         Cook| 59|California|   12|
+-----------+-------------+---+----------+-----+

In [5]:
df.printSchema()

root
 |-- employee_id: string (nullable = true)
 |-- employee_name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- location: string (nullable = true)
 |-- hours: string (nullable = true)

In [7]:
df = spark.read.csv("./datos/employee_data.csv",header=True,inferSchema=True) 
df.printSchema()

root
 |-- employee_id: string (nullable = true)
 |-- employee_name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- location: string (nullable = true)
 |-- hours: integer (nullable = true)

In [8]:
df.columns

['employee_id', 'employee_name', 'age', 'location', 'hours']

## Trabajando con columnas en Spark

In [19]:
df['age'].show()

TypeError: 'Column' object is not callable

In [9]:
df.select('age').show()

+---+
|age|
+---+
| 47|
| 64|
| 56|
| 59|
+---+

In [10]:
df.select(['employee_name', 'age']).show()

+-------------+---+
|employee_name|age|
+-------------+---+
|       Pichai| 47|
|         Bill| 64|
|         Jeff| 56|
|         Cook| 59|
+-------------+---+

In [11]:
df['employee_name', 'age'].show()

+-------------+---+
|employee_name|age|
+-------------+---+
|       Pichai| 47|
|         Bill| 64|
|         Jeff| 56|
|         Cook| 59|
+-------------+---+

## Nuevas columnas

In [20]:
df_new = df.withColumn('horas_extras', df['hours'])
df_new.show()

+-----------+-------------+---+----------+-----+------------+
|employee_id|employee_name|age|  location|hours|horas_extras|
+-----------+-------------+---+----------+-----+------------+
|       G001|       Pichai| 47|California|   14|          14|
|       M002|         Bill| 64|Washington|   10|          10|
|       A003|         Jeff| 56|Washington|   11|          11|
|       A004|         Cook| 59|California|   12|          12|
+-----------+-------------+---+----------+-----+------------+

## Renombrar columnas

In [23]:
df_renamed = df.withColumnRenamed('hours', 'horas')
df_renamed.show()

+-----------+-------------+---+----------+-----+
|employee_id|employee_name|age|  location|horas|
+-----------+-------------+---+----------+-----+
|       G001|       Pichai| 47|California|   14|
|       M002|         Bill| 64|Washington|   10|
|       A003|         Jeff| 56|Washington|   11|
|       A004|         Cook| 59|California|   12|
+-----------+-------------+---+----------+-----+

## Eliminar una columna

In [25]:
df_new = df_new.drop('hours')
df_new.show()

+-----------+-------------+---+----------+------------+
|employee_id|employee_name|age|  location|horas_extras|
+-----------+-------------+---+----------+------------+
|       G001|       Pichai| 47|California|          14|
|       M002|         Bill| 64|Washington|          10|
|       A003|         Jeff| 56|Washington|          11|
|       A004|         Cook| 59|California|          12|
+-----------+-------------+---+----------+------------+

## Cálculo de estadísticas globales

In [30]:
df_new = df.withColumn("productive_hours",df["hours"]-3)
df_renamed = df_new.withColumnRenamed("hours","working_hours")
df_final = df_renamed.drop("location") 
df_final.head(3)

[Row(employee_id='G001', employee_name='Pichai', age=47, working_hours=14, productive_hours=11),
 Row(employee_id='M002', employee_name='Bill', age=64, working_hours=10, productive_hours=7),
 Row(employee_id='A003', employee_name='Jeff', age=56, working_hours=11, productive_hours=8)]

In [31]:
print("\nSummary of Age, Working hours and Productive hours")
summary_data = df_final.select(["age","working_hours","productive_hours"])
summary_data.describe().show()

Summary of Age, Working hours and Productive hours
+-------+----------------+-----------------+-----------------+
|summary|             age|    working_hours| productive_hours|
+-------+----------------+-----------------+-----------------+
|  count|               4|                4|                4|
|   mean|            56.5|            11.75|             8.75|
| stddev|7.14142842854285|1.707825127659933|1.707825127659933|
|    min|              47|               10|                7|
|    max|              64|               14|               11|
+-------+----------------+-----------------+-----------------+

## SQL con los dataframes de Spark

In [32]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("SparkSQL").getOrCreate()

df = spark.read.csv("./datos/employee_data.csv",header=True,inferSchema=True)

df.createOrReplaceTempView("associates") 

sql_result_1 = spark.sql("SELECT * FROM associates") 

sql_result_1.show()

+-----------+-------------+---+----------+-----+
|employee_id|employee_name|age|  location|hours|
+-----------+-------------+---+----------+-----+
|       G001|       Pichai| 47|California|   14|
|       M002|         Bill| 64|Washington|   10|
|       A003|         Jeff| 56|Washington|   11|
|       A004|         Cook| 59|California|   12|
+-----------+-------------+---+----------+-----+

In [34]:
sql_result_2 = spark.sql("SELECT * FROM associates WHERE age BETWEEN 45 AND 60 AND location='California'")
sql_result_2.show()

+-----------+-------------+---+----------+-----+
|employee_id|employee_name|age|  location|hours|
+-----------+-------------+---+----------+-----+
|       G001|       Pichai| 47|California|   14|
|       A004|         Cook| 59|California|   12|
+-----------+-------------+---+----------+-----+

## Operaciones y funciones con los dataframes de Spark

In [35]:

from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("SparkFilters").getOrCreate()

df = spark.read.csv("./datos/items_bought.csv",header=True,inferSchema=True)
df.show(4)

+----------+---------+----------+--------+----------+------------+
|      date|item_name|item_price|quantity|tax_amount|total_amount|
+----------+---------+----------+--------+----------+------------+
|11-10-2018|     Beer|     110.5|       2|     53.04|      163.54|
|14-02-2018|   Whisky|    1250.0|       1|     300.0|      1550.0|
|23-03-2020|   Whisky|    1300.5|       2|    624.24|     1924.74|
|05-10-2018|      Rum|     550.0|       2|     264.0|       814.0|
+----------+---------+----------+--------+----------+------------+
only showing top 4 rows

In [36]:
df.filter("total_amount>1500").show()

+----------+---------+----------+--------+----------+------------+
|      date|item_name|item_price|quantity|tax_amount|total_amount|
+----------+---------+----------+--------+----------+------------+
|14-02-2018|   Whisky|    1250.0|       1|     300.0|      1550.0|
|23-03-2020|   Whisky|    1300.5|       2|    624.24|     1924.74|
+----------+---------+----------+--------+----------+------------+

In [37]:
df.filter((df["item_price"]>1000)&(df["tax_amount"]>500)).show()

+----------+---------+----------+--------+----------+------------+
|      date|item_name|item_price|quantity|tax_amount|total_amount|
+----------+---------+----------+--------+----------+------------+
|23-03-2020|   Whisky|    1300.5|       2|    624.24|     1924.74|
+----------+---------+----------+--------+----------+------------+

In [39]:
result_data = df.filter((df["total_amount"]==1924.74)).collect()
resulting_date = result_data[0]["date"] 
print("The collected data point's date value is " + resulting_date)

The collected data point's date value is 23-03-2020

In [40]:
result_data[0].asDict()

{'date': '23-03-2020',
 'item_name': 'Whisky',
 'item_price': 1300.5,
 'quantity': 2,
 'tax_amount': 624.24,
 'total_amount': 1924.74}

## Función groupBy y función de agregación

In [45]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('SparkGroupBy&Agg').getOrCreate()

df = spark.read.csv("./datos/company_product_revenue.csv",header=True,inferSchema=True)
df.show(4)

+-------------+------------+-------------+
| company_name|product_name|revenue_sales|
+-------------+------------+-------------+
|         Audi|          A4|          450|
|Mercedes Benz|     G Class|         1200|
|          BMW|          X1|          425|
|     Mahindra|     XUV 500|          850|
+-------------+------------+-------------+
only showing top 4 rows

In [51]:
print("Total revenue_sales per company")
df.groupBy("company_name").sum().show()

Total revenue_sales per company
+-------------+------------------+
| company_name|sum(revenue_sales)|
+-------------+------------------+
|          Kia|              1140|
|         Audi|              2275|
|     Mahindra|              1640|
|          BMW|              1975|
|Mercedes Benz|              2570|
+-------------+------------------+

In [52]:
print("Total revenue_sales for the entire data")
df.agg({"revenue_sales":"sum"}).show()

Total revenue_sales for the entire data
+------------------+
|sum(revenue_sales)|
+------------------+
|              9600|
+------------------+

In [53]:
print("Max revenue_sales value per company")
df.groupBy("company_name").agg({"revenue_sales":"max"}).show()

Max revenue_sales value per company
+-------------+------------------+
| company_name|max(revenue_sales)|
+-------------+------------------+
|          Kia|               690|
|         Audi|               725|
|     Mahindra|               850|
|          BMW|               850|
|Mercedes Benz|              1200|
+-------------+------------------+

In [54]:
print("Ordering the data based on the revenue_sales in ascending order")
df.orderBy("revenue_sales").show(5)

Ordering the data based on the revenue_sales in ascending order
+-------------+------------+-------------+
| company_name|product_name|revenue_sales|
+-------------+------------+-------------+
|          BMW|          X1|          425|
|         Audi|          A4|          450|
|          Kia|    Carnival|          450|
|Mercedes Benz|     C Class|          470|
|         Audi|          Q7|          500|
+-------------+------------+-------------+
only showing top 5 rows

In [55]:
print("Ordering the data based on the revenue_sales in descending order")
df.orderBy(df["revenue_sales"].desc()).show(5)

Ordering the data based on the revenue_sales in descending order
+-------------+------------+-------------+
| company_name|product_name|revenue_sales|
+-------------+------------+-------------+
|Mercedes Benz|     G Class|         1200|
|Mercedes Benz|         GLS|          900|
|     Mahindra|     XUV 500|          850|
|          BMW|          X5|          850|
|     Mahindra|     XUV 300|          790|
+-------------+------------+-------------+
only showing top 5 rows

## Otras funciones

In [56]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("SparkInbuiltFunctions").getOrCreate()

from pyspark.sql.functions import mean,avg,format_number 

df = spark.read.csv("./datos/company_product_revenue.csv",header=True,inferSchema =True)

df.select(mean("revenue_sales").alias("Mean Revenue Sales")).show()

+------------------+
|Mean Revenue Sales|
+------------------+
| 685.7142857142857|
+------------------+

In [59]:
result_avg = df.select(avg("revenue_sales").alias("Average Revenue Sales")) 
result_avg.show()

+---------------------+
|Average Revenue Sales|
+---------------------+
|    685.7142857142857|
+---------------------+

In [60]:
result_avg.head()[0]

685.7142857142857

In [61]:
result_avg.select(format_number("Average revenue Sales",2).alias("Formatted Average")).show()

+-----------------+
|Formatted Average|
+-----------------+
|           685.71|
+-----------------+

## Resolver datos faltantes en los dataframes

In [63]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("SparkMisingData").getOrCreate()
df = spark.read.csv("./datos/employee_data.csv",header=True,inferSchema=True)
df.show()

+-----------+-------------+----+----------+-----+
|employee_id|employee_name| age|  location|hours|
+-----------+-------------+----+----------+-----+
|       G001|       Pichai|  47|California|   14|
|       M002|         Bill|  64|Washington| null|
|       A003|         Jeff|  56|      null| null|
|       A004|         null|null|      null|   12|
+-----------+-------------+----+----------+-----+

In [64]:
print("Data after dropping the rows having null values")
df.na.drop().show()

Data after dropping the rows having null values
+-----------+-------------+---+----------+-----+
|employee_id|employee_name|age|  location|hours|
+-----------+-------------+---+----------+-----+
|       G001|       Pichai| 47|California|   14|
+-----------+-------------+---+----------+-----+

In [65]:
print("Data after dropping the rows having atleast 4 non-null values")
df.na.drop(thresh=4).show()

Data after dropping the rows having atleast 4 non-null values
+-----------+-------------+---+----------+-----+
|employee_id|employee_name|age|  location|hours|
+-----------+-------------+---+----------+-----+
|       G001|       Pichai| 47|California|   14|
|       M002|         Bill| 64|Washington| null|
+-----------+-------------+---+----------+-----+

In [66]:
print("Data after dropping the rows having null values in hours column")
df.na.drop(subset="hours").show()

Data after dropping the rows having null values in hours column
+-----------+-------------+----+----------+-----+
|employee_id|employee_name| age|  location|hours|
+-----------+-------------+----+----------+-----+
|       G001|       Pichai|  47|California|   14|
|       A004|         null|null|      null|   12|
+-----------+-------------+----+----------+-----+

In [67]:
print("Data after filling the rows having null values in hours column")
df.na.fill(12,subset="hours").show()

Data after filling the rows having null values in hours column
+-----------+-------------+----+----------+-----+
|employee_id|employee_name| age|  location|hours|
+-----------+-------------+----+----------+-----+
|       G001|       Pichai|  47|California|   14|
|       M002|         Bill|  64|Washington|   12|
|       A003|         Jeff|  56|      null|   12|
|       A004|         null|null|      null|   12|
+-----------+-------------+----+----------+-----+

In [68]:
from pyspark.sql.functions import mean 
mean_value = df.select(mean("hours")).collect()[0][0]

print("Data after filling the rows having null values in hours column with calculated mean value")
df.na.fill(mean_value,subset="hours").show()

Data after filling the rows having null values in hours column with calculated mean value
+-----------+-------------+----+----------+-----+
|employee_id|employee_name| age|  location|hours|
+-----------+-------------+----+----------+-----+
|       G001|       Pichai|  47|California|   14|
|       M002|         Bill|  64|Washington|   13|
|       A003|         Jeff|  56|      null|   13|
|       A004|         null|null|      null|   12|
+-----------+-------------+----+----------+-----+

In [69]:
print("Data after replacing a specific rows value in employee_name column")
df.na.replace("Pichai","Sundar",subset="employee_name").show()

Data after replacing a specific rows value in employee_name column
+-----------+-------------+----+----------+-----+
|employee_id|employee_name| age|  location|hours|
+-----------+-------------+----+----------+-----+
|       G001|       Sundar|  47|California|   14|
|       M002|         Bill|  64|Washington| null|
|       A003|         Jeff|  56|      null| null|
|       A004|         null|null|      null|   12|
+-----------+-------------+----+----------+-----+

## Datos fecha y hora en Spark Dataframe

In [71]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("SparkDateTime").getOrCreate()

df = spark.read.csv("./datos/items_bought.csv",header=True,inferSchema=True)
df.show(3)

+----------+---------+----------+--------+----------+------------+
|      date|item_name|item_price|quantity|tax_amount|total_amount|
+----------+---------+----------+--------+----------+------------+
|11-10-2018|     Beer|     110.5|       2|     53.04|      163.54|
|14-02-2018|   Whisky|    1250.0|       1|     300.0|      1550.0|
|23-03-2020|   Whisky|    1300.5|       2|    624.24|     1924.74|
+----------+---------+----------+--------+----------+------------+
only showing top 3 rows

In [72]:
print("Schema with date as string datatype")
df.printSchema()

Schema with date as string datatype
root
 |-- date: string (nullable = true)
 |-- item_name: string (nullable = true)
 |-- item_price: double (nullable = true)
 |-- quantity: integer (nullable = true)
 |-- tax_amount: double (nullable = true)
 |-- total_amount: double (nullable = true)

In [74]:
from pyspark.sql.functions import unix_timestamp, from_unixtime, to_date 
updated_df = df.withColumn('formatted_date',to_date(unix_timestamp(df['date'],'dd-MM-yyyy').cast('timestamp')))

print("Schema with date column string datatype converted to date datatype")
updated_df.printSchema()

Schema with date column string datatype converted to date datatype
root
 |-- date: string (nullable = true)
 |-- item_name: string (nullable = true)
 |-- item_price: double (nullable = true)
 |-- quantity: integer (nullable = true)
 |-- tax_amount: double (nullable = true)
 |-- total_amount: double (nullable = true)
 |-- formatted_date: date (nullable = true)

In [75]:
print("Data after dropping the date column which was of string type")
updated_df=updated_df.drop("date") #dropping the date column with string type
updated_df.show(2)

Data after dropping the date column which was of string type
+---------+----------+--------+----------+------------+--------------+
|item_name|item_price|quantity|tax_amount|total_amount|formatted_date|
+---------+----------+--------+----------+------------+--------------+
|     Beer|     110.5|       2|     53.04|      163.54|    2018-10-11|
|   Whisky|    1250.0|       1|     300.0|      1550.0|    2018-02-14|
+---------+----------+--------+----------+------------+--------------+
only showing top 2 rows

In [76]:
from pyspark.sql.functions import weekofyear, dayofmonth,month,year,date_format 

print("Data Extraction from dates")
final_df = updated_df.select(updated_df["item_name"],
weekofyear(updated_df["formatted_date"]).alias("week_number"),
dayofmonth(updated_df["formatted_date"]).alias("day_number"),
month(updated_df["formatted_date"]).alias("month"),
year(updated_df["formatted_date"]).alias("year"))
final_df.show(3)

Data Extraction from dates
+---------+-----------+----------+-----+----+
|item_name|week_number|day_number|month|year|
+---------+-----------+----------+-----+----+
|     Beer|         41|        11|   10|2018|
|   Whisky|          7|        14|    2|2018|
|   Whisky|         13|        23|    3|2020|
+---------+-----------+----------+-----+----+
only showing top 3 rows

In [77]:
#convertir el tipo de fecha a una cadena de formato de fecha diferente
date_string_value = updated_df.select(df["item_name"],date_format(updated_df["formatted_date"],'MM/dd/yyyy')) 
date_string_value.show(2)

+---------+---------------------------------------+
|item_name|date_format(formatted_date, MM/dd/yyyy)|
+---------+---------------------------------------+
|     Beer|                             10/11/2018|
|   Whisky|                             02/14/2018|
+---------+---------------------------------------+
only showing top 2 rows

In [78]:
print("Usecase - Total amount of items purchased in that particular year")
final_format=final_df.groupBy("year").sum().select(["year","sum(year)"])
final_format.withColumnRenamed("sum(year)","Total Expenditure").show()

Usecase - Total amount of items purchased in that particular year
+----+-----------------+
|year|Total Expenditure|
+----+-----------------+
|2018|             6054|
|2019|             4038|
|2020|             8080|
+----+-----------------+